{
    "Home": "Beranda",
    "About Us": "Tentang Kami",
    "Products": "Produk",
    "News": "Berita",
    "Capabilities": "Kapabilitas",
    "Vision & Mission": "Visi & Misi",
    "Organization": "Organisasi",
    "Facilities": "Fasilitas",
    "Customers": "Pelanggan",
    "Contact": "Kontak",
    "Sales Growth": "Pertumbuhan Penjualan",
    "Production Quality": "Kualitas Produksi",
    "Loading Capacity": "Kapasitas Pemuatan",
    "Dashboard": "Dashboard",
    "Login": "Masuk",
    "Register": "Daftar",
    "Logout": "Keluar",
    "View Details": "Lihat Detail",
    "Read More": "Baca Selengkapnya",
    "Search": "Cari",
    "All Rights Reserved": "Hak Cipta Dilindungi",
    "Engineering the Future with Precision": "Membangun Masa Depan dengan Presisi",
    "Leading Tier 2 automotive partner in Indonesia": "Mitra otomotif Tier 2 terkemuka di Indonesia",
    "Change Language": "Ubah Bahasa",
    "Indonesia's Most Professional": "Partner Tier 2",
    "Tier 2 Partner": "Paling Profesional di Indonesia",
    "Our Journey & Values": "Perjalanan & Nilai-Nilai Kami",
    "Indonesia's Most Professional Tier 2 Partner": "Mitra Tier 2 Paling Profesional di Indonesia",
    "What We Do": "Apa Yang Kami Lakukan",
    "Specialized Automotive Manufacturing Capabilities": "Kapabilitas Manufaktur Otomotif Khusus",
    "Our Output": "Hasil Produksi Kami",
    "High-Precision Automotive Products": "Produk Otomotif Presisi Tinggi",
    "Latest Updates": "Pembaruan Terkini",
    "Latest News & Industry Insights": "Berita Terbaru & Wawasan Industri",
    "Get in Touch": "Hubungi Kami",
    "Connect with Us": "Terhubung dengan Kami",
    "A leading automotive spare parts manufacturer committed to Empowerment, Excellence, Integrity, Service, and Tenacity.": "Produsen suku cadang otomotif terkemuka yang berkomitmen pada Pemberdayaan, Keunggulan, Integritas, Layanan, dan Kegigihan.",
    "Our Capabilities": "Kapabilitas Kami",
    "Stamping": "Stamping",
    "Welding": "Welding",
    "Bending": "Bending",
    "Our Plants": "Pabrik Kami",
    "Company": "Perusahaan",
    "Core Values": "Nilai Inti",
    "Contact Us": "Hubungi Kami",
    "Future Manufacturing": "Manufaktur Masa Depan",
    "Advanced Welding & Stamping solutions for the automotive industry. We engineer the future with integrity and excellence.": "Solusi Pengelasan & Stamping Canggih untuk industri otomotif. Kami membangun masa depan dengan integritas dan keunggulan.",
    "Explore TCF": "Jelajahi TCF",
    "Smart Factory": "Pabrik Pintar",
    "Industry 4.0 Ready": "Siap Industri 4.0",
    "ISO Certified": "Bersertifikat ISO",
    "Global Quality Standards": "Standar Kualitas Global",
    "Leading Tier 2 Automotive Manufacturing Since 2017": "Manufaktur Otomotif Tier 2 Terkemuka Sejak 2017",
    "PT Tri Centrum Fortuna has grown from a visionary foundation into a key player in the automotive manufacturing sector. With a relentless focus on quality and innovation, we have expanded our operations to serve global automotive leaders.": "PT Tri Centrum Fortuna telah tumbuh dari fondasi visioner menjadi pemain kunci di sektor manufaktur otomotif. Dengan fokus tanpa henti pada kualitas dan inovasi, kami telah memperluas operasi kami untuk melayani pemimpin otomotif global.",
    "Operating from our strategic facilities in Karawang and Purwakarta, we deliver high-precision stamping and welding solutions that meet the rigorous standards of the industry.": "Beroperasi dari fasilitas strategis kami di Karawang dan Purwakarta, we deliver high-precision stamping and welding solutions that meet the rigorous standards of the industry.",
    "Our Core Values: EXIST": "Nilai Inti Kami: EXIST",
    "Empowerment": "Pemberdayaan",
    "Giving our people the strength and confidence to achieve more.": "Memberikan kekuatan dan kepercayaan diri kepada orang-orang kami untuk mencapai lebih banyak.",
    "Excellence": "Keunggulan",
    "Striving for highest quality and distinction in everything we do.": "Berusaha untuk kualitas tertinggi dan keunikan dalam segala hal yang kami lakukan.",
    "Integrity": "Integritas",
    "Upholding honesty and strong moral principles in our business.": "Menjunjung tinggi kejujuran dan prinsip moral yang kuat dalam bisnis kami.",
    "Service": "Layanan",
    "Dedication to meeting customer needs with superior service.": "Dedikasi untuk memenuhi kebutuhan pelanggan dengan layanan unggul.",
    "Tenacity": "Kegigihan",
    "Persistent determination to overcome challenges and succeed.": "Tekad yang gigih untuk mengatasi tantangan dan berhasil.",
    "STAMPING": "STAMPING",
    "High-tonnage press capabilities delivering intricate automotive components with micron-level accuracy.": "Kemampuan mesin press bertonase tinggi yang menghasilkan komponen otomotif rumit dengan akurasi tingkat mikron.",
    "WELDING": "PENGELASAN",
    "State-of-the-art automated welding lines ensuring structural integrity and consistent quality.": "Lini pengelasan otomatis mutakhir yang memastikan integritas struktural dan kualitas yang konsisten.",
    "BENDING": "TEKUK (BENDING)",
    "Precision bending services for complex geometries and structural requirements.": "Layanan tekuk presisi untuk geometri kompleks dan persyaratan struktural.",
    "MACHINING": "PEMESINAN (MACHINING)",
    "Advanced CNC machining for tight tolerances and high-quality surface finishes.": "Pemesinan CNC canggih untuk toleransi ketat dan penyelesaian permukaan berkualitas tinggi.",
    "PAINTING": "PENGECATAN (PAINTING)",
    "Automated painting lines providing superior corrosion protection and aesthetic finish.": "Lini pengecatan otomatis yang memberikan perlindungan korosi unggul dan hasil akhir estetis.",
    "DIE MAKING": "PEMBUATAN CETAKAN (DIE MAKING)",
    "In-house design and manufacturing of high-precision dies and tooling.": "Desain dan manufaktur cetakan (die) dan perkakas (tooling) presisi tinggi secara internal.",
    "View Performance & Growth": "Lihat Performa & Pertumbuhan",
    "Delivering high-precision components used by leading automotive manufacturers globally.": "Menghasilkan komponen presisi tinggi yang digunakan oleh produsen otomotif terkemuka secara global.",
    "View All Products": "Lihat Semua Produk",
    "Strategic Partners": "Mitra Strategis",
    "Read Article": "Baca Artikel",
    "More News": "Berita Lainnya",
    "Want to know more about us?": "Ingin tahu lebih banyak tentang kami?",
    "Download our detailed profile and view our certifications.": "Unduh profil detail kami dan lihat sertifikasi kami.",
    "Download": "Unduh",
    "Head Office & Factory": "Kantor Pusat & Pabrik",
    "Phone": "Telepon",
    "Email": "Email",
    "Plant Purwakarta": "Pabrik Purwakarta",
    "Plant Karawang": "Pabrik Karawang",
    "Our History": "Sejarah Kami",
    "Close": "Tutup",
    "2017:": "2017:",
    "PT Tri Centrum Fortuna was founded with a clear vision to support the growing automotive industry in Indonesia. Starting with a small facility in Karawang, we focused on precision stamping for 2-wheelers.": "PT Tri Centrum Fortuna didirikan dengan visi yang jelas untuk mendukung pertumbuhan industri otomotif di Indonesia. Dimulai dengan fasilitas kecil di Karawang, kami fokus pada stamping presisi untuk kendaraan roda 2.",
    "2019:": "2019:",
    "Expanded capabilities to include Robotic Welding, securing our first major contract with a Tier-1 automotive supplier.": "Memperluas kapabilitas dengan menyertakan Pengelasan Robotik, mengamankan kontrak besar pertama kami dengan pemasok otomotif Tier-1.",
    "2021:": "2021:",
    "Despite global challenges, we prepared for major expansion, designing our modern facilities for high-volume production.": "Meskipun ada tantangan global, kami bersiap untuk ekspansi besar, merancang fasilitas modern kami untuk produksi volume tinggi.",
    "2024:": "2024:",
    "To meet increasing demand, we established **Plant Karawang** (Headquarters). This expansion allowed us to diversify into heavier stamping parts and improve our logistics network across West Java.": "Untuk memenuhi permintaan yang meningkat, kami mendirikan **Pabrik Karawang** (Kantor Pusat). Ekspansi ini memungkinkan kami untuk mendiversifikasi ke bagian stamping yang lebih berat dan meningkatkan jaringan logistik kami di seluruh Jawa Barat.",
    "2026:": "2026:",
    "Today, TCF stands as a beacon of manufacturing excellence, employing over 500 skilled professionals and serving as a trusted partner to major automotive brands.": "Hari ini, TCF berdiri sebagai mercu suar keunggulan manufaktur, mempekerjakan lebih dari 500 profesional terampil dan berfungsi sebagai mitra terpercaya bagi merek otomotif utama.",
    "Back to News": "Kembali ke Berita",
    "Share this Insight": "Bagikan Wawasan Ini",
    "Help others discover our manufacturing updates": "Bantu orang lain menemukan pembaruan manufaktur kami",
    "Article Info": "Info Artikel",
    "Published By": "Diterbitkan Oleh",
    "TCF Media Team": "Tim Media TCF",
    "Reading Time": "Waktu Baca",
    "Minutes": "Menit",
    "Approx. 5-7 Minutes": "Sekitar 5-7 Menit",
    "Category Tag": "Tag Kategori",
    "Insights": "Wawasan",
    "Related Tags": "Tag Terkait",
    "Interested in our services?": "Tertarik dengan layanan kami?",
    "Request a technical consultation or a quote for your stamping and welding assembly needs.": "Ajukan konsultasi teknis atau penawaran untuk kebutuhan perakitan stamping dan welding Anda.",
    "Contact Sales": "Hubungi Sales",
    "Have a question?": "Punya pertanyaan?",
    "Feel free to message our team for any inquiries about our manufacturing process.": "Jangan ragu untuk menghubungi tim kami untuk pertanyaan apa pun tentang proses manufaktur kami.",
    "Our Identity": "Identitas Kami",
    "Our guiding principles and long-term goals for success, committed to excellence in every component we manufacture.": "Prinsip panduan dan tujuan jangka panjang kami untuk sukses, berkomitmen pada keunggulan dalam setiap komponen yang kami produksi.",
    "TRI CENTRUM FORTUNA": "TRI CENTRUM FORTUNA",
    "Tri Centrum Fortuna began its operations in 2017 as a company specializing in stamping, welding, painting, and machining of high-precision parts used primarily in the automotive industry and other sectors.": "Tri Centrum Fortuna memulai operasionalnya pada tahun 2017 sebagai perusahaan yang berspesialisasi dalam stamping, welding, painting, dan machining suku cadang presisi tinggi yang digunakan terutama dalam industri otomotif dan sektor lainnya.",
    "PT Tri Centrum Fortuna is fully committed to prioritizing customer satisfaction by delivering orders on time, with the right quality and quantity, accompanied by a spirit of persistence and dedication.": "PT Tri Centrum Fortuna berkomitmen penuh untuk memprioritaskan kepuasan pelanggan dengan memberikan pesanan tepat waktu, dengan kualitas dan kuantitas yang tepat, disertai dengan semangat keteguhan dan dedikasi.",
    "VISION": "VISI",
    "\"Striving to be the first-choice second-tier metal parts manufacturing company and the best partner by fostering cooperation, continuous improvement, and innovation.\"": "\"Berusaha menjadi perusahaan manufaktur suku cadang logam tingkat kedua pilihan pertama dan mitra terbaik dengan membina kerja sama, perbaikan terus-menerus, dan inovasi.\"",
    "MISSION": "MISI",
    "Manufacturing high-quality components in a safe and comfortable working environment to meet the expectations and satisfaction of our partners.": "Memproduksi komponen berkualitas tinggi dalam lingkungan kerja yang aman dan nyaman untuk memenuhi harapan dan kepuasan mitra kami.",
    "Building effective and efficient organizational management by aligning and developing human resources in terms of skills, work ethic, and welfare to achieve superior corporate governance, operational sustainability, and profitability.": "Membangun manajemen organisasi yang efektif dan efisien dengan menyelaraskan dan mengembangkan sumber daya manusia dalam hal keterampilan, etos kerja, dan kesejahteraan untuk mencapai tata kelola perusahaan yang unggul, keberlanjutan operasional, dan profitabilitas.",
    "Our Leadership": "Kepemimpinan Kami",
    "Organization Structure": "Struktur Organisasi",
    "Our leadership team dedicated to driving excellence and innovation across all levels of our manufacturing operations.": "Tim kepemimpinan kami yang berdedikasi untuk mendorong keunggulan dan inovasi di semua tingkat operasional manufaktur kami.",
    "President Director": "Direktur Utama",
    "Operational Director": "Direktur Operasional",
    "Administration Director": "Direktur Administrasi",
    "Manufacturing": "Manufaktur",
    "Engineering": "Teknik",
    "Cost Control": "Kontrol Biaya",
    "Scroll horizontally to view full chart": "Geser horizontal untuk melihat bagan lengkap",
    "Production Excellence": "Keunggulan Produksi",
    "Operating from strategic locations to serve our partners efficiently, equipped with high-precision machinery and automated systems.": "Beroperasi dari lokasi strategis untuk melayani mitra kami secara efisien, dilengkapi dengan mesin presisi tinggi dan sistem otomatis.",
    "PLANT – PURWAKARTA": "PABRIK – PURWAKARTA",
    "PLANT – KARAWANG": "PABRIK – KARAWANG",
    "Detailed Facility & Equipment Overview": "Gambaran Detail Fasilitas & Peralatan",
    "Factory Layout": "Tata Letak Pabrik",
    "View Full Screen": "Lihat Layar Penuh",
    "Production Facilities & Equipment": "Fasilitas & Peralatan Produksi",
    "View Plant Details": "Lihat Detail Pabrik",
    "Strategic Roadmap": "Peta Jalan Strategis",
    "Target & Milestones": "Target & Pencapaian",
    "Financial Report": "Laporan Keuangan",
    "Sales & Growth Analysis": "Analisis Penjualan & Pertumbuhan",
    "Sales Performance Record": "Catatan Performa Penjualan",
    "Sales (Billion)": "Penjualan (Miliar)",
    "Growth Trend": "Tren Pertumbuhan",
    "Witness TCF's consistent growth and expanding market share in the automotive industry. Our performance reflects our commitment to quality and partnership.": "Saksikan pertumbuhan konsisten TCF dan pangsa pasar yang meluas di industri otomotif. Performa kami mencerminkan komitmen kami terhadap kualitas dan kemitraan.",
    "Consistent performance and strategic expansion in the Indonesian automotive manufacturing sector.": "Performa konsisten dan ekspansi strategis di sektor manufaktur otomotif Indonesia.",
    "Precision Manufacturing": "Manufaktur Presisi",
    "Our High-Quality Products": "Produk Berkualitas Tinggi Kami",
    "Explore our comprehensive range of stamped and welded components, engineered for durability and manufactured to world-class standards.": "Jelajahi berbagai komponen stamping dan welding kami yang komprehensif, dirancang untuk daya tahan dan diproduksi dengan standar kelas dunia.",
    "Search our products...": "Cari produk kami...",
    "Automotive Part": "Suku Cadang Otomotif",
    "No products found": "Produk tidak ditemukan",
    "Try adjusting your search criteria": "Coba sesuaikan kriteria pencarian Anda",
    "Media Center": "Pusat Media",
    "Search Articles": "Cari Artikel",
    "Search by keywords...": "Cari berdasarkan kata kunci...",
    "Categories": "Kategori",
    "Need a professional manufacturing partner?": "Butuh mitra manufaktur profesional?",
    "Check our production capabilities and see how we can support your business with high-precision components.": "Lihat kapabilitas produksi kami dan lihat bagaimana kami dapat mendukung bisnis Anda dengan komponen presisi tinggi.",
    "Read Full Article": "Baca Artikel Lengkap",
    "No news articles found for this search/category.": "Tidak ada artikel berita yang ditemukan untuk pencarian/kategori ini.",
    "5 min read": "5 menit baca",
    "Back to Menu": "Kembali ke Menu",
    "All": "Semua",
    "Industry": "Industri",
    "Corporate": "Korporat",
    "Technology": "Teknologi",
    "Technical": "Teknis",
    "Business": "Bisnis",
    "CSR": "CSR",
    "Events": "Acara",
    "General": "Umum",
    "Industry Insights": "Wawasan Industri"
}